{
  "How are you?": "I'm fine thank you",
  "Who are you?": "I'm Turing's AI assistant",
  "In HN22 tumour show me the spatial correlation graph of CAF and CD4 T cells": "<p>Here are the spatial correlation networks for CAF and CD4 T-cells:</p><p>Reminder: these spatial correlation networks show the correlations between genes spatially showing a common behaviour of a set of genes associated to a cell types.</p><p><img src=\"hn22_caf.png\" style=\"width: 400px; height: auto; margin: 10px;\"/><img src=\"hn22_cd4_tcell.png\"  style=\"width: 400px; height: auto; margin: 10px;\"/></p>",
  "Now show me the spatial correlation graphs of exhausted CD4 and exhausted CD8": "<p>Here are the spatial correlation networks for the exhausted CD4 and exhausted CD8:</p><p>Reminder: these spatial correlation networks show the correlations between genes spatially showing a common behaviour of a set of genes associated to a cell types.</p><p><img src=\"hn22_exhausted_cd4.png\"  style=\"width: 400px; height: auto; margin: 10px;\" /><img src=\"hn22_exhausted_cd8.png\"  style=\"width: 400px; height: auto; margin: 10px;\" /></p>",
  "Show me the cell-cell interactions between CAFs and Tregs": "<p>Here is the network of interactions between CAFs and Tregs, this is based on the protein-protein and metabolites-proteins (or ligand-receptors) interactions of the cell types selected.</p><img src=\"interactions_net.png\" style=\"width: 700px; height: auto; margin: 10px;\" /></br><img src=\"ui_thumbnail.png\" style=\"width: 700px; height: auto; margin: 10px;\" /></br><a class=\"bp5-button\" role=\"button\" tabindex={0}>Show more</a>",
  "What are the possible interactions of CAFs and CD4+ Tcells via CXCL12 chemokines? Is there some knowledge on this?": "<p>CXCL12 binds CXRC4 inducing downstream pathways such as CXCR7 and CCR5, CCR5 is known to interact with CD4+ T-cells.</p><p>See reasoning graph:</p><p><img src=\"reasoning_path_interactions.png\" style=\"width: 1000px; height: auto\" /><a class=\"bp5-button\" role=\"button\" tabindex={0}>Show more</a></p><p><b>Summary:</b></p><p>CXCL12 is a chemokine that binds to CXCR4 and CXCR7 receptors, activating signaling pathways that regulate cell migration, proliferation and gene expression; there is evidence that the CXCL12/CXCR4/CXCR7 axis promotes tumor growth, survival, angiogenesis and metastasis, as well as chemoresistance, and small molecule inhibitors targeting these receptors show promise as novel targeted cancer therapies.</p><p><b>References:</b></p><p>1- Shi, Yi, David J. Riese, and Jianzhong Shen. The role of the CXCL12/CXCR4/CXCR7 chemokine axis in cancer. Frontiers in pharmacology 11 (2020): 574667.</p><p>2- Guo, F., et al. CXCL12/CXCR4: a symbiotic bridge linking cancer cells and their stromal neighbors in oncogenic communication networks. Oncogene 35.7 (2016): 816-826.</p>",
"What drugs in my database Turing_drugs could lead to inhibition of the CAF - Treg activation pathways? Also highlight if there is any from Sanofi": "<p>Here are the main drugs:</p><ul><li>Sarilumab (SANOFI)</li><li>Mozobil / Plerixafor (GENZYME - SANOFI)</li><li>Tocilizumab</li></li>Satralizumab</li></ul><p>The main reasoning path is that CCR4 is upregulated by the IL10 signalling pathway which also upregulates TNFRSF1B.</p><p>STAT3 upregulates both TNFRS1B and IL6R.</p><p>There is a possible feedback loop of regulation if IL6 receptors are inhibited it could lead to a CCR5 inhibition.</p><p>Other reasoning path is direct inhibition of CXCR4 to block the CXCL12 binding from CAF signalling.</p><p>See reasoning graph:</p><p><img src=\"network_sanofi_drugs.png\" style=\"width: 1000px; height: auto;\" /><a class=\"bp5-button\" role=\"button\" tabindex={0}>Show more</a></p>"
}
